Wang-Nainai/SmartKnob/sdkconfig.defaults
# SmartKnob ESP32-S3 基线配置（不含任何机密/密码）
# 完整配置在本地 sdkconfig（由 idf.py 生成，不入库）
# 新机器复现：复制本文件为 sdkconfig 后执行 idf.py menuconfig 修改个人 WiFi/MQTT 凭据

# ---- 目标芯片 ----
CONFIG_IDF_TARGET="esp32s3"

# ---- Flash / 分区 ----
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# ---- CPU ----
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=160
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_160=y
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_MHZ=160

# ---- 看门狗（5s，检查空闲任务） ----
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=5
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=y
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=y

# ---- 电机（无机密） ----
CONFIG_MOTOR_ENABLE=y
CONFIG_MOTOR_PWM_A=15
CONFIG_MOTOR_PWM_B=16
CONFIG_MOTOR_PWM_C=17
CONFIG_MOTOR_EN_PIN=18
CONFIG_MOTOR_MT6701_INTERFACE_ABZ=y
CONFIG_MOTOR_MT6701_ABZ_A_PIN=7
CONFIG_MOTOR_MT6701_ABZ_B_PIN=4
CONFIG_MOTOR_MT6701_ABZ_PPR=1024
CONFIG_MOTOR_POLE_PAIRS=7
CONFIG_MOTOR_VOLTAGE_SUPPLY=12
CONFIG_MOTOR_VOLTAGE_LIMIT=5
CONFIG_MOTOR_TASK_CORE=1

# ---- SCD40 ----
CONFIG_SCD40_SDA_PIN=5
CONFIG_SCD40_SCL_PIN=6
CONFIG_SCD40_POLL_INTERVAL_MS=2000
CONFIG_SCD40_I2C_SPEED_HZ=100000

# ---- MQTT HA（仅开关，凭据走 NVS/网页配置） ----
CONFIG_MQTT_HA_ENABLE=y
CONFIG_MQTT_HA_TOPIC="knob"

# ---- Web 配置 / OTA ----
CONFIG_WEBCFG_ENABLE=y
CONFIG_WEBCFG_HTTP_PORT=80

# ---- LVGL（9.2） ----
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_COLOR_DEPTH=16
CONFIG_LV_MEM_SIZE_KILOBYTES=64
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_26=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_USE_SCALE=y
CONFIG_LV_USE_QRCODE=y
CONFIG_LV_USE_OS=0

# ---- 串口 ----
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# ---- BLE HID (S-Dial 电脑控制, NimBLE) ----
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_NVS_PERSIST=y

# ---- WiFi 缓冲缩减(旋钮场景, BLE 同开时防堆耗尽) ----
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=6
CONFIG_ESP_WIFI_MGMT_SBUF_NUM=6

# ---- PSRAM (N16R8 板载 8MB Octal) ----
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
CONFIG_LV_DEF_REFR_PERIOD=16
